
#+BEGIN_SRC shell
for x in {01..10} ; do echo "$x" ; done
#+END_SRC

#+RESULTS:
|  1 |
|  2 |
|  3 |
|  4 |
|  5 |
|  6 |
|  7 |
|  8 |
|  9 |
| 10 |



#+BEGIN_SRC scheme
(printf "Hello!")
#+END_SRC

#+RESULTS:

#+BEGIN_SRC ruby
[3, 5, 9, 11].each do |num|
  p num
end
#+END_SRC

#+RESULTS:
| 3 | 5 | 9 | 11 |

